@echo off

::【无参示例1】 遍历当前目录下的所有文件
for %%i in (*) do ( echo %%i )
echo ----------------------

::【无参示例2】 遍历在(匹配符)中指定路径下的以 .csproj 结尾的文件
for %%i in (../*.csproj) do ( echo %%i )
echo ----------------------


:: 【/d 示例】遍历当前路径的文件夹下的文件夹
for /d %%i in (../*) do ( echo %%i )
echo ----------------------


::【/r 示例】深度遍历指定路径下的所有文件，子目录中的文件也会被遍历到
for /r %%i in (*) do ( echo %%i )
echo ----------------------


::【/l 示例】等效于 java 中的 for (int i = 1; i <= 5; i++)
for /l %%i in (1, 1, 5) do ( echo %%i )
echo ----------------------


::【】
for /d /r %%i in (../*) do ( echo %%i )
echo ----------------------



pause